# Create DataFrame

In [7]:
import pandas as pd

column = ["Name" , "Address" ,"Gender","Phone"]
column

['Name', 'Address', 'Gender', 'Phone']

In [12]:
stud1 = pd.DataFrame([
           ["Manish","Mumbai","M" ,12345],
           ["Deepak" ,"Goa" ,"M" ,123456]
         ],columns=column)
stud1

     Name Address Gender   Phone
0  Manish  Mumbai      M   12345
1  Deepak     Goa      M  123456

In [18]:
stud2 = pd.DataFrame( 
                     dict(Name=['peter', 'julie'],
                           Address=[33, 44], 
                           Gender=['M', 'F'],
                          Phone=[123456, 1234567])
                   )

stud2

    Name  Address Gender    Phone
0  peter       33      M   123456
1  julie       44      F  1234567

In [20]:
# merge to dataFrame

     Name Address Gender    Phone
0  Manish  Mumbai      M    12345
1  Deepak     Goa      M   123456
0   peter      33      M   123456
1   julie      44      F  1234567

In [21]:
stud = pd.concat([stud1,stud2])
stud

     Name Address Gender    Phone
0  Manish  Mumbai      M    12345
1  Deepak     Goa      M   123456
0   peter      33      M   123456
1   julie      44      F  1234567